Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1064DAB169.atdf
         <register caption="Graphics LCD Controller Layer x Mode Register (X = 0-2)" name="GLCDL2MODE" offset="0x70" rw="RW" size="4">
            <bitfield caption="Color Mode bits" mask="0x0000000F" name="COLORMODE" values="GLCDL2MODE__COLORMODE" />
            <bitfield caption="Source Blending Function bits" mask="0x00000F00" name="SRCBLEND" values="GLCDL2MODE__SRCBLEND" />
            <bitfield caption="Destinary Blending Function bits" mask="0x0000F000" name="DESTBLEND" values="GLCDL2MODE__DESTBLEND" />
            <bitfield mask="0x00FF0000" name="ALPHA" />
            <bitfield caption="Premultiply Image Alpha bit" mask="0x10000000" name="MULALPHA" values="GLCDL2MODE__MULALPHA" />
            <bitfield caption="Force Alpha with Global Alpha bit" mask="0x20000000" name="FORCEALPHA" values="GLCDL2MODE__FORCEALPHA" />
            <bitfield caption="Disable Bilinear Filtering bit" mask="0x40000000" name="DISABIFIL" values="GLCDL2MODE__DISABIFIL" />
            <bitfield caption="Layer Enable bit" mask="0x80000000" name="LAYEREN" values="GLCDL2MODE__LAYEREN" />
         </register>
         <register caption="" name="GLCDL0START" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="STARTY" />
            <bitfield mask="0x07FF0000" name="STARTX" />
         </register>
         <register caption="" name="GLCDL1START" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="STARTY" />
            <bitfield mask="0x07FF0000" name="STARTX" />
         </register>
         <register caption="" name="GLCDL2START" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="STARTY" />
            <bitfield mask="0x07FF0000" name="STARTX" />
         </register>
         <register caption="" name="GLCDL0SIZE" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SIZEY" />
            <bitfield mask="0x07FF0000" name="SIZEX" />
         </register>
         <register caption="" name="GLCDL1SIZE" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SIZEY" />
            <bitfield mask="0x07FF0000" name="SIZEX" />
         </register>
         <register caption="" name="GLCDL2SIZE" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SIZEY" />
            <bitfield mask="0x07FF0000" name="SIZEX" />
         </register>
         <register caption="" name="GLCDL0BADDR" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="BASEADDR" />
         </register>
         <register caption="" name="GLCDL1BADDR" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="BASEADDR" />
         </register>
         <register caption="" name="GLCDL2BADDR" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="BASEADDR" />
         </register>
         <register caption="" name="GLCDL0STRIDE" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRIDE" />
         </register>
         <register caption="" name="GLCDL1STRIDE" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRIDE" />
         </register>
         <register caption="" name="GLCDL2STRIDE" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRIDE" />
         </register>
         <register caption="" name="GLCDL0RES" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RESY" />
            <bitfield mask="0x07FF0000" name="RESX" />
         </register>
         <register caption="" name="GLCDL1RES" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RESY" />
            <bitfield mask="0x07FF0000" name="RESX" />
         </register>
         <register caption="" name="GLCDL2RES" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RESY" />
            <bitfield mask="0x07FF0000" name="RESX" />
         </register>
         <register caption="Graphics LCD Controller Interrupt Register" name="GLCDINT" offset="0xf8" rw="RW" size="4">
            <bitfield caption="VSYNC Interrupt Enable bit" mask="0x00000001" name="VSYNCINT" values="GLCDINT__VSYNCINT" />
            <bitfield mask="0x00000002" name="HSYNCINT" />
            <bitfield caption="IRQ Triggering Control bit" mask="0x80000000" name="IRQCON" values="GLCDINT__IRQCON" />
         </register>
         <register caption="Graphics LCD Controller Status Register" name="GLCDSTAT" offset="0xfc" rw="R" size="4">
            <bitfield caption="Active bit" mask="0x00000001" name="ACTIVE" values="GLCDSTAT__ACTIVE" />
            <bitfield mask="0x00000002" name="DE" />
            <bitfield mask="0x00000004" name="HSYNC" />
            <bitfield mask="0x00000008" name="VSYNC" />
            <bitfield caption="Last Row bit" mask="0x00000020" name="LROW" values="GLCDSTAT__LROW" />
         </register>
         <register caption="" name="GLCDCLUT0" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT1" offset="0x404" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT2" offset="0x408" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT3" offset="0x40C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT4" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
