Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1064DAB169.atdf
         <register caption="" name="IPC17" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD9IS" />
            <bitfield mask="0x0000001C" name="ADCD9IP" />
            <bitfield mask="0x00000300" name="ADCD10IS" />
            <bitfield mask="0x00001C00" name="ADCD10IP" />
            <bitfield mask="0x00030000" name="ADCD11IS" />
            <bitfield mask="0x001C0000" name="ADCD11IP" />
            <bitfield mask="0x03000000" name="ADCD12IS" />
            <bitfield mask="0x1C000000" name="ADCD12IP" />
         </register>
         <register caption="" name="IPC18" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD13IS" />
            <bitfield mask="0x0000001C" name="ADCD13IP" />
            <bitfield mask="0x00000300" name="ADCD14IS" />
            <bitfield mask="0x00001C00" name="ADCD14IP" />
            <bitfield mask="0x00030000" name="ADCD15IS" />
            <bitfield mask="0x001C0000" name="ADCD15IP" />
            <bitfield mask="0x03000000" name="ADCD16IS" />
            <bitfield mask="0x1C000000" name="ADCD16IP" />
         </register>
         <register caption="" name="IPC19" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD17IS" />
            <bitfield mask="0x0000001C" name="ADCD17IP" />
            <bitfield mask="0x00000300" name="ADCD18IS" />
            <bitfield mask="0x00001C00" name="ADCD18IP" />
            <bitfield mask="0x00030000" name="ADCD19IS" />
            <bitfield mask="0x001C0000" name="ADCD19IP" />
            <bitfield mask="0x03000000" name="ADCD20IS" />
            <bitfield mask="0x1C000000" name="ADCD20IP" />
         </register>
         <register caption="" name="IPC20" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD21IS" />
            <bitfield mask="0x0000001C" name="ADCD21IP" />
            <bitfield mask="0x00000300" name="ADCD22IS" />
            <bitfield mask="0x00001C00" name="ADCD22IP" />
            <bitfield mask="0x00030000" name="ADCD23IS" />
            <bitfield mask="0x001C0000" name="ADCD23IP" />
            <bitfield mask="0x03000000" name="ADCD24IS" />
            <bitfield mask="0x1C000000" name="ADCD24IP" />
         </register>
         <register caption="" name="IPC21" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD25IS" />
            <bitfield mask="0x0000001C" name="ADCD25IP" />
            <bitfield mask="0x00000300" name="ADCD26IS" />
            <bitfield mask="0x00001C00" name="ADCD26IP" />
            <bitfield mask="0x00030000" name="ADCD27IS" />
            <bitfield mask="0x001C0000" name="ADCD27IP" />
            <bitfield mask="0x03000000" name="ADCD28IS" />
            <bitfield mask="0x1C000000" name="ADCD28IP" />
         </register>
         <register caption="" name="IPC22" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD29IS" />
            <bitfield mask="0x0000001C" name="ADCD29IP" />
            <bitfield mask="0x00000300" name="ADCD30IS" />
            <bitfield mask="0x00001C00" name="ADCD30IP" />
            <bitfield mask="0x00030000" name="ADCD31IS" />
            <bitfield mask="0x001C0000" name="ADCD31IP" />
            <bitfield mask="0x03000000" name="ADCD32IS" />
            <bitfield mask="0x1C000000" name="ADCD32IP" />
         </register>
         <register caption="" name="IPC23" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD33IS" />
            <bitfield mask="0x0000001C" name="ADCD33IP" />
            <bitfield mask="0x00000300" name="ADCD34IS" />
            <bitfield mask="0x00001C00" name="ADCD34IP" />
            <bitfield mask="0x00030000" name="ADCD35IS" />
            <bitfield mask="0x001C0000" name="ADCD35IP" />
            <bitfield mask="0x03000000" name="ADCD36IS" />
            <bitfield mask="0x1C000000" name="ADCD36IP" />
         </register>
         <register caption="" name="IPC24" offset="0x2c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD37IS" />
            <bitfield mask="0x0000001C" name="ADCD37IP" />
            <bitfield mask="0x00000300" name="ADCD38IS" />
            <bitfield mask="0x00001C00" name="ADCD38IP" />
            <bitfield mask="0x00030000" name="ADCD39IS" />
            <bitfield mask="0x001C0000" name="ADCD39IP" />
            <bitfield mask="0x03000000" name="ADCD40IS" />
            <bitfield mask="0x1C000000" name="ADCD40IP" />
         </register>
         <register caption="" name="IPC25" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD41IS" />
            <bitfield mask="0x0000001C" name="ADCD41IP" />
            <bitfield mask="0x00000300" name="ADCD42IS" />
            <bitfield mask="0x00001C00" name="ADCD42IP" />
            <bitfield mask="0x00030000" name="ADCD43IS" />
            <bitfield mask="0x001C0000" name="ADCD43IP" />
         </register>
         <register caption="" name="IPC26" offset="0x2e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CPCIS" />
            <bitfield mask="0x0000001C" name="CPCIP" />
            <bitfield mask="0x00000300" name="CFDCIS" />
            <bitfield mask="0x00001C00" name="CFDCIP" />
            <bitfield mask="0x00030000" name="SBIS" />
            <bitfield mask="0x001C0000" name="SBIP" />
            <bitfield mask="0x03000000" name="CRPTIS" />
            <bitfield mask="0x1C000000" name="CRPTIP" />
         </register>
         <register caption="" name="IPC27" offset="0x2f0" rw="RW" size="4">
            <bitfield mask="0x00000300" name="SPI1EIS" />
            <bitfield mask="0x00001C00" name="SPI1EIP" />
            <bitfield mask="0x00030000" name="SPI1RXIS" />
            <bitfield mask="0x001C0000" name="SPI1RXIP" />
            <bitfield mask="0x03000000" name="SPI1TXIS" />
            <bitfield mask="0x1C000000" name="SPI1TXIP" />
         </register>
         <register caption="" name="IPC28" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U1EIS" />
            <bitfield mask="0x0000001C" name="U1EIP" />
            <bitfield mask="0x00000300" name="U1RXIS" />
            <bitfield mask="0x00001C00" name="U1RXIP" />
            <bitfield mask="0x00030000" name="U1TXIS" />
            <bitfield mask="0x001C0000" name="U1TXIP" />
            <bitfield mask="0x03000000" name="I2C1BIS" />
            <bitfield mask="0x1C000000" name="I2C1BIP" />
         </register>
         <register caption="" name="IPC29" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C1SIS" />
            <bitfield mask="0x0000001C" name="I2C1SIP" />
            <bitfield mask="0x00000300" name="I2C1MIS" />
            <bitfield mask="0x00001C00" name="I2C1MIP" />
            <bitfield mask="0x00030000" name="CNAIS" />
            <bitfield mask="0x001C0000" name="CNAIP" />
            <bitfield mask="0x03000000" name="CNBIS" />
            <bitfield mask="0x1C000000" name="CNBIP" />
         </register>
