Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1064DAB169.atdf
         <register caption="UARTx Status and Control Register" name="U3STA" offset="0x410" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U3STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U3STA__OERR" />
            <bitfield caption="Framing Error Status bit (read-only)" mask="0x00000004" name="FERR" values="U3STA__FERR" />
            <bitfield caption="Parity Error Status bit (read-only)" mask="0x00000008" name="PERR" values="U3STA__PERR" />
            <bitfield caption="Receiver Idle bit (read-only)" mask="0x00000010" name="RIDLE" values="U3STA__RIDLE" />
            <bitfield caption="Address Character Detect bit (bit 8 of received data = 1)" mask="0x00000020" name="ADDEN" values="U3STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U3STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U3STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U3STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U3STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U3STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U3STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U3STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U3STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="UARTx Address Match Mask bits" mask="0xFF000000" name="MASK" values="U3STA__MASK" />
         </register>
         <register caption="UARTx Status and Control Register" name="U4STA" offset="0x610" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U4STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U4STA__OERR" />
            <bitfield caption="Framing Error Status bit (read-only)" mask="0x00000004" name="FERR" values="U4STA__FERR" />
            <bitfield caption="Parity Error Status bit (read-only)" mask="0x00000008" name="PERR" values="U4STA__PERR" />
            <bitfield caption="Receiver Idle bit (read-only)" mask="0x00000010" name="RIDLE" values="U4STA__RIDLE" />
            <bitfield caption="Address Character Detect bit (bit 8 of received data = 1)" mask="0x00000020" name="ADDEN" values="U4STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U4STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U4STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U4STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U4STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U4STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U4STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U4STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U4STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="UARTx Address Match Mask bits" mask="0xFF000000" name="MASK" values="U4STA__MASK" />
         </register>
         <register caption="UARTx Status and Control Register" name="U5STA" offset="0x810" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U5STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U5STA__OERR" />
            <bitfield caption="Framing Error Status bit (read-only)" mask="0x00000004" name="FERR" values="U5STA__FERR" />
            <bitfield caption="Parity Error Status bit (read-only)" mask="0x00000008" name="PERR" values="U5STA__PERR" />
            <bitfield caption="Receiver Idle bit (read-only)" mask="0x00000010" name="RIDLE" values="U5STA__RIDLE" />
            <bitfield caption="Address Character Detect bit (bit 8 of received data = 1)" mask="0x00000020" name="ADDEN" values="U5STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U5STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U5STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U5STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U5STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U5STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U5STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U5STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U5STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="UARTx Address Match Mask bits" mask="0xFF000000" name="MASK" values="U5STA__MASK" />
         </register>
